mowglinext/mowglinext/firmware/stm32/ros_usbnode/src/main.c
      // DB_TRACE("master_rx_STATUS: %d  drivemotors_rx_buf_idx: %d  cnt_usart2_overrun: %x\r\n", master_rx_STATUS, drivemotors_rx_buf_idx, cnt_usart2_overrun);
    }
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
    /* try to send ros message without delay*/
    if (ULTRASONIC_MessageReceived() == 1)
    {
      ultrasonic_handler();
    }
    if (NBT_handler(&main_ultrasonicsensor_nbt))
    {
      ULTRASONICSENSOR_App();
    }
#endif
    if (NBT_handler(&main_wdg_nbt))
    {
      WATCHDOG_Refresh();
    }

    if (NBT_handler(&main_drivemotor_nbt))
    {
      DRIVEMOTOR_App_10ms();
    }

    if (NBT_handler(&main_blademotor_nbt))
    {
      BLADEMOTOR_App();

#ifdef OPTION_PERIMETER
      if (!Perimeter_UsesDebug())
#endif
      {
        uint32_t currentTick;
        static uint32_t old_tick;
        DB_TRACE(" temp : %.2f \n", blade_temperature);
        currentTick = HAL_GetTick();
        DB_TRACE(" Current ticktime: %d    \r", (currentTick - old_tick));
        old_tick = currentTick;
      }
    }

    if (NBT_handler(&main_buzzer_nbt))
    {
      // TODO
      if (do_chirp)
      {
        TIM3_Handle.Instance->CCR4 = 10; // chirp on
        TIM4_Handle.Instance->CCR3 = 10; // chirp on
        do_chirp = 0;
        do_chirp_duration_counter = 0;
      }
      if (do_chirp_duration_counter == 1)
      {
        TIM3_Handle.Instance->CCR4 = 0; // chirp off
        TIM4_Handle.Instance->CCR3 = 0; // chirp off
      }
      do_chirp_duration_counter++;
    }

#ifndef I_DONT_NEED_MY_FINGERS
    if (NBT_handler(&main_emergency_nbt))
    {
      EmergencyController();
    }
#endif
  }
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  // we never get here ...
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
}

#if BOARD_HAS_MASTER_USART
// The STM32f1 has enough USARTs to use one for debugging

/**
 * @brief Init the Master Serial Port  - this what connects to the upstream controller
 * @retval None
 */
void MASTER_USART_Init()
{
  // enable port and usart clocks
  MASTER_USART_GPIO_CLK_ENABLE();
  MASTER_USART_USART_CLK_ENABLE();

  GPIO_InitTypeDef GPIO_InitStruct;
  // RX
  GPIO_InitStruct.Pin = MASTER_USART_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(MASTER_USART_RX_PORT, &GPIO_InitStruct);

  // TX
  GPIO_InitStruct.Pin = MASTER_USART_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  // GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(MASTER_USART_TX_PORT, &GPIO_InitStruct);

  MASTER_USART_Handler.Instance = MASTER_USART_INSTANCE;     // USART1 (DEV)
  MASTER_USART_Handler.Init.BaudRate = 115200;               // Baud rate
  MASTER_USART_Handler.Init.WordLength = UART_WORDLENGTH_8B; // The word is  8  Bit format
  MASTER_USART_Handler.Init.StopBits = USART_STOPBITS_1;     // A stop bit
  MASTER_USART_Handler.Init.Parity = UART_PARITY_NONE;       // No parity bit
  MASTER_USART_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE; // No hardware flow control
  MASTER_USART_Handler.Init.Mode = USART_MODE_TX_RX;         // Transceiver mode

  HAL_UART_Init(&MASTER_USART_Handler); // HAL_UART_Init() Will enable  UART1

  /* UART4 DMA Init */
  /* UART4_RX Init */
  hdma_uart4_rx.Instance = DMA2_Channel3;
  hdma_uart4_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_uart4_rx.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_uart4_rx.Init.MemInc = DMA_MINC_ENABLE;
  hdma_uart4_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_uart4_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_uart4_rx.Init.Mode = DMA_NORMAL;
  hdma_uart4_rx.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_uart4_rx) != HAL_OK)
  {
    Error_Handler();
  }

  __HAL_LINKDMA(&MASTER_USART_Handler, hdmarx, hdma_uart4_rx);

  /* UART4 DMA Init */
  /* UART4_TX Init */
  hdma_uart4_tx.Instance = DMA2_Channel5;
  hdma_uart4_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
  hdma_uart4_tx.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_uart4_tx.Init.MemInc = DMA_MINC_ENABLE;
  hdma_uart4_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_uart4_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_uart4_tx.Init.Mode = DMA_NORMAL;
  hdma_uart4_tx.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_uart4_tx) != HAL_OK)
  {
    Error_Handler();
  }

  __HAL_LINKDMA(&MASTER_USART_Handler, hdmatx, hdma_uart4_tx);

  // enable IRQ
  HAL_NVIC_SetPriority(MASTER_USART_IRQ, 0, 0);
  HAL_NVIC_EnableIRQ(MASTER_USART_IRQ);

  __HAL_UART_ENABLE_IT(&MASTER_USART_Handler, UART_IT_TC);
}
#endif

/**
 * @brief Init LED
 * @retval None
 */
void LED_Init()
{
  LED_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = LED_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(LED_GPIO_PORT, &GPIO_InitStruct);
}

/**
 * @brief Poll RAIN Sensor
 * @retval 1 if rain is detected, 0 if no rain
 */
int RAIN_Sense(void)
{
  return (!HAL_GPIO_ReadPin(RAIN_SENSOR_PORT, RAIN_SENSOR_PIN)); // pullup, active low
}

/**
 * @brief Init RAIN Sensor (PE2) Input
 * @retval None
 */
void RAIN_Sensor_Init()
{
  RAIN_SENSOR_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = RAIN_SENSOR_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(RAIN_SENSOR_PORT, &GPIO_InitStruct);
}

/**
 * @brief Init HALL STOP Sensor (PD2&3) Inputs
 * @retval None
 */
void HALLSTOP_Sensor_Init()
{
  HALLSTOP_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(HALLSTOP_PORT, &GPIO_InitStruct);
}

/**
 * @brief Poll HALLSTOP_Left_Sense Sensor
 * @retval  1 if trigger , 0 if no stop sensor trigger
 */
int HALLSTOP_Left_Sense(void)
{
#if OPTION_BUMPER == 1
  return (HAL_GPIO_ReadPin(HALLSTOP_PORT, GPIO_PIN_2));
#else
  return 0;
#endif
}

/**
 * @brief Poll HALLSTOP_Right_Sense
 * @retval 1 if trigger , 0 if no stop sensor trigger
 */
int HALLSTOP_Right_Sense(void)
{
#if OPTION_BUMPER == 1
  return (HAL_GPIO_ReadPin(HALLSTOP_PORT, GPIO_PIN_3));
#else
  return 0;
#endif
}

/**
 * @brief Init TF4 (24V Power Switch)
 * @retval None
 */
void TF4_Init()
{
  TF4_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = TF4_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(TF4_GPIO_PORT, &GPIO_InitStruct);
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
    DB_TRACE("Error Handler reached, oops\r\n");
    chirp(1);
  }
  /* USER CODE END Error_Handler_Debug */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

