mowglinext/mowglinext/firmware/stm32/ros_usbnode/src/main.c
/*
 * Initialize Watchdog - not tested yet (by Nekraus)
 */
static void WATCHDOG_vInit(void)
{
#if defined(DB_ACTIVE)
  /* setup DBGMCU block - stop IWDG at break in debug mode */
  __HAL_FREEZE_IWDG_DBGMCU();
#endif /* DB_ACTIVE */

  /* change the period to 50ms */
  IwdgHandle.Instance = IWDG;
  IwdgHandle.Init.Prescaler = IWDG_PRESCALER_256;
  IwdgHandle.Init.Reload = 0xFFF;
  /* Enable IWDG (LSI automatically enabled by HW) */

  /* if window feature is not applied Init() precedes Start() */
  if (HAL_IWDG_Init(&IwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" IWDG init Error\r\n");
#endif /* DB_ACTIVE */
  }

#if ENABLE_WWDG
/* Initialize WWDG for run time if applicable */
#if defined(DB_ACTIVE)
  /* setup DBGMCU block - stop WWDG at break in debug mode */
  __HAL_FREEZE_WWDG_DBGMCU();
#endif /* DB_ACTIVE */

  /* Setup period - 20ms */
  __WWDG_CLK_ENABLE();
  WwdgHandle.Instance = WWDG;
  WwdgHandle.Init.Prescaler = WWDG_PRESCALER_8;
  WwdgHandle.Init.Counter = 0x7F; /* 40.02 ms*/
  WwdgHandle.Init.Window = 0x7F;  /* 0ms */
  if( HAL_WWDG_Init(&WwdgHandle) != HAL_OK )
  {
#ifdef DB_ACTIVE
    DB_TRACE(" WWDG init Error\r\n");
#endif /* DB_ACTIVE */
  }
#endif /* ENABLE_WWDG */
} /* WATCHDOG_vInit() */

/*
 * Feed the watchdog every 10ms
 */
static void WATCHDOG_Refresh(void)
{
  const uint32_t now = HAL_GetTick();
  if (g_watchdog_last_refresh_tick != 0u)
  {
    const uint32_t gap_ms = now - g_watchdog_last_refresh_tick;
    g_watchdog_last_refresh_gap_ms = gap_ms;
    if (gap_ms > g_watchdog_max_refresh_gap_ms)
    {
      g_watchdog_max_refresh_gap_ms = gap_ms;
    }
    if (gap_ms > 20u)
    {
      g_watchdog_gap_over_20ms_count++;
    }
    if (gap_ms > 30u)
    {
      g_watchdog_gap_over_30ms_count++;
    }
    if (gap_ms > 35u)
    {
      g_watchdog_gap_over_35ms_count++;
    }
  }
  g_watchdog_last_refresh_tick = now;
  g_watchdog_refresh_count++;
#if ENABLE_WWDG
  /* Update WWDG counter */
  WwdgHandle.Instance = WWDG;
  if (HAL_WWDG_Refresh(&WwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" WWDG refresh error\r\n");
#endif /* DB_ACTIVE */
  }
#endif /* ENABLE_WWDG */
  /* Reload IWDG counter */
  IwdgHandle.Instance = IWDG;
  if (HAL_IWDG_Refresh(&IwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" IWDG refresh error\r\n");
#endif /* DB_ACTIVE */
  }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * called when DMA transfer completes
 * update <xxxx>_tx_busy to let XXXX_Transmit function now when the DMA buffer is free
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
#if BOARD_HAS_MASTER_USART
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
    /* HAL invokes this callback on TX completion, so release the busy flag
     * unconditionally. It was previously gated on a re-read of USART_FLAG_TC;
     * when TC had not yet latched at callback time the flag was left set
     * forever, so the next MASTER_Transmit() spun in its busy-wait, starved the
     * main loop, and the window watchdog reset the board. */
    master_tx_busy = 0;
  }
#endif
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * Master UART receive ISR
 * DriveMotors UART receive ISR
 * PANEL UART receive ISR
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
#if BOARD_HAS_MASTER_USART
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
    ULTRASONICSENSOR_ReceiveIT();
#endif
  }
  else
#endif
  if (huart->Instance == BLADEMOTOR_USART_INSTANCE)
  {
    BLADEMOTOR_ReceiveIT();
  }
  else if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
  {
    DRIVEMOTOR_ReceiveIT();
  }
}
